changed process flow diagram
